export const heros = [
    {
        code: 'elder_titan',
        name: '上古巨神',
        nickname: '大牛',
        stat: '力量',
        attackType: '近战',
        line: '运用灵体游魂伤害并控制敌人',
        description: '用灵体游魂探明敌情后，上古巨神从任意方向发动突袭。他巨蹄的重踏可以让敌人停下，他的存在则蚕食敌人的防御，而他还能撕裂大地本身，使敌人一一倒下。',
        defaultAbility: {
            name: '局势失衡',
            desc: '受到防御符文或者肉山的旗帜作用的友方小兵和建筑造成100%额外伤害。',
        },
        ability: [
            {
                name: '回音重踏',
                desc: '持续施法 - 上古巨神与他的灵体游魂一起践踏地面，对敌方单位造成伤害并使他们在原地昏迷。上古巨神造成物理伤害，灵体游魂造成魔法伤害。',
                lore: '创世之力依然在巨神的重踏下回响。',
                img: 'elder_titan_echo_stomp.png',
            },
            {
                name: '灵体游魂',
                desc: '上古巨神放出他的灵体游魂，灵魂对任何经过的单位都会造成伤害。当它与巨神合体时，它每伤害过一个单位都会给予若干攻击力、护甲和移动速度加成。',
                lore: '就像四大基本法则，上古巨神在所有位面同时存在，可以在需要协助的时候将其他位面的自己拖入。',
                img: 'elder_titan_ancestral_spirit.png',
            },
            {
                name: '自然秩序',
                desc: '使所有元素降低至基础水平，移除附近敌方单位的基础物理护甲和魔法抗性。护甲降低效果以英雄为中心，魔法抗性降低效果以灵体游魂为中心。',
                lore: '上古巨神又让创世之初重现。',
                img: 'elder_titan_natural_order.png',
            },
            {
                name: '裂地沟壑',
                desc: '上古巨神向前方放出一道不平坦的裂纹。3秒后裂纹塌陷，范围内的单位将被减速，并受到基于他们自身生命最大值的伤害。其中一半伤害为魔法伤害，另一半为物理伤害。',
                lore: '巨神创造之世，他亲手将其撕裂。',
                img: 'elder_titan_earth_splitter.png',
            }
        ],
        talents: [
            {
                level: 10,
                desc: '获得+15力量',
            },
            {
                level: 10,
                desc: '获得+15攻击力',
            },
            {
                level: 15,
                desc: '获得+20护甲',
            },
            {
                level: 15,
                desc: '获得+20%移动速度',
            },
            {
                level: 20,
                desc: '回音重踏造成的昏迷时间增加1秒',
            },
            {
                level: 20,
                desc: '自然秩序的范围增加100',
            },
            {
                level: 25,
                desc: '裂地沟壑的伤害增加100',
            },
            {
                level: 25,
                desc: '裂地沟壑的减速效果增加20%',
            },
        ],
    }
]